{
  "episode_001": {
      "title": "Episode 1: Crafting a career framework",
      "description": "You’re wondering if you should stay in your current role, or maybe you’re stressed about accepting a new one. Well, you’re not alone. In his decade of career coaching, Nikhyl Singhal has often listened to executives wrestle with these dilemmas. And in this first Skip Podcast, he poses five specific questions that he believes can help you create your best path forward and shape your career framework. ",
      "date": "2023-01-23",
      "duration": "25:59",
      "url": "https://www.youtube.com/watch?v=ZoAwJxx9me0&list=PLgQx-_Sn5yxrjZBlp0alCFUjgJECMY6f0&index=9"
  },
  "episode_002": {
      "title": "Episode 2: Career FAQ with Nikhyl Singhal",
      "description": "Tech moves fast and is ever evolving. But career worries remain constant and can weigh heavily. In this second Skip podcast, Nikhyl Singhal highlights what he calls “career frequently asked questions”: common concerns people share with him, and how you might approach these concerns to reach the best results for your own professional life. Building a career framework is important, but assessing the complexities branching off of it is vital as well. And he’s hoping you will keep the questions coming! ",
      "date": "2023-01-16",
      "duration": "28:38",
      "url": "https://www.youtube.com/watch?v=TmJ_Fm9ymR4"
  },
  "episode_003": {
    "title": "Episode 3: World Class Lawyers Share The Best Strategies for Executive Compensation",
    "description": "Equity, stock options, and all other forms of Executive compensation; a complex topic that has essentially limitless negotiable options. We are going to be walking through the basics to lay a foundation and then break down the most common mistakes that people make in this area. If you need learn more about offer letters, vesting stocks, and managing exits this episode is for you!",
    "date": "2023-02-13",
    "duration": "65:48",
    "url": "https://www.youtube.com/watch?v=qQMXR9N08a0&list=PLgQx-_Sn5yxrjZBlp0alCFUjgJECMY6f0&index=7"
},
  "episode_004": {
      "title": "Episode 4: Product Management Executives share their keys to success in the Tech Industry",
      "description": "Welcome back to the Skip podcast! In this episode, Nikhyl invites Shreyas Doshi to discuss the ever-evolving role that Product Managers have in today's business world, finding yourself “stuck” in the ‘middle-stage’ of your career and how making high-quality career decisions is more important than ever. Shreyas has led & scaled products at Stripe, Twitter, Google, and Yahoo for a combined 15 years as a product manager & PM leader. In this next chapter of his career, he is an advisor for fast-growing startups across the globe and is building out content & courses based on his experience of building successful products & teams across various domains. ",
      "date": "2023-02-27",
      "duration": "71:05",
      "url": "https://www.youtube.com/watch?v=y_TnXtnY3QM&list=PLgQx-_Sn5yxrjZBlp0alCFUjgJECMY6f0&index=6"
  }
}